tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "joshmedeski/sesh"
tap "jstkdng/programs"
tap "olets/tap"
tap "saulpw/vd"
brew "antidote"
brew "asdf"
brew "atuin"
brew "bash"
brew "bat"
brew "bear"
brew "biber"
brew "bob"
brew "chafa"
brew "cmake"
brew "coreutils"
brew "curl"
brew "deno"
brew "difftastic"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "folderify"
brew "fzf"
brew "fzy"
brew "gcc"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "gnu-tar"
brew "graphviz"
brew "gzip"
brew "httpie"
brew "imagemagick"
brew "joshmedeski/sesh/sesh"
brew "jq"
brew "jstkdng/programs/ueberzugpp"
brew "just"
brew "lazygit"
brew "llvm"
brew "luajit"
brew "luarocks"
brew "mas"
brew "mise"
brew "neovim"
brew "ninja"
brew "olets/tap/zsh-abbr"
brew "opam"
brew "pam-reattach"
brew "pandoc"
brew "pkg-config"
brew "pngpaste"
brew "readline"
brew "ripgrep"
brew "saulpw/vd/visidata"
brew "stylua"
brew "tectonic"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "unzip"
brew "viu"
brew "wget"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "font-iosevka-term-nerd-font"
cask "hiddenbar"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "lunar"
cask "mactex-no-gui"
cask "middleclick"
cask "pictogram"
cask "quarto"
cask "raycast"
cask "rectangle"
cask "skim"
cask "stats"
cask "zulu"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Noir", id: 1592917505
mas "Velja", id: 1607635845
mas "Wipr", id: 1320666476
mas "iPreview", id: 1519213509
